<!-- add-pr-comment:add-pr-comment -->

**Terraform Plan**
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_eks_cluster.this[0] has changed
  ~ resource "aws_eks_cluster" "this" {
        id                            = "basic-webapp-eks"
        name                          = "basic-webapp-eks"
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
      ~ version                       = "1.32" -> "1.29"
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.eu-west-1.amazonaws.com/id/C3CDCD3745504A569BAB2A939D152546"
    }

  # module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "basic-webapp-eks"
        name                          = "basic-webapp-eks"
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
      ~ version                       = "1.29" -> "1.30"
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::347913851454:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/C3CDCD3745504A569BAB2A939D152546"
        tags            = {
            "Name" = "basic-webapp-eks-eks-irsa"
        }
      ~ tags_all        = {
          + "created_by"   = "terraform"
          + "project_name" = "k8s-basic-webapp"
            # (1 unchanged element hidden)
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2025-07-30T18:57:28Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "cluster_version"                    = "1.29" -> "1.30"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2_x86_64" -> "AL2023_x86_64_STANDARD"
      ~ arn                    = "arn:aws:eks:eu-west-1:347913851454:nodegroup/basic-webapp-eks/default-20250730185735044900000012/2ecc2e59-3866-35a2-13d6-a71803ec301e" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "basic-webapp-eks:default-20250730185735044900000012" -> (known after apply)
      ~ instance_types         = [
          ~ "t3.medium" -> "t3.micro",
        ]
      - labels                 = {} -> null
      ~ node_group_name        = "default-20250730185735044900000012" -> (known after apply)
      ~ release_version        = "1.29.15-20250715" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-default-20250730185735044900000012-2ecc2e59-3866-35a2-13d6-a71803ec301e"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Name" = "default"
        }
      ~ tags_all               = {
          + "created_by"   = "terraform"
          + "project_name" = "k8s-basic-webapp"
            # (1 unchanged element hidden)
        }
      ~ version                = "1.29" -> "1.30"
        # (4 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0a6056cf7ea230d76"
          ~ name    = "default-20250730185729216500000010" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ node_repair_config (known after apply)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                                   = "lt-0a6056cf7ea230d76"
        name                                 = "default-20250730185729216500000010"
        tags                                 = {}
      ~ tags_all                             = {
          + "created_by"   = "terraform"
          + "project_name" = "k8s-basic-webapp"
        }
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "5f947689-97c7-4a37-adad-5c73fc3c7fc4"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::347913851454:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::347913851454:user/idmitriev" -> "arn:aws:iam::347913851454:role/github-actions-eks-deploy"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::347913851454:role/basic-webapp-eks-cluster-20250730184750636600000002"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

```